app/controllers/user_controller.rb

	def create

	  @user = User.new(user_params)
	  puts "KKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKK#{@user.inspect}"
	  # store all emails in lowercase to avoid duplicates and case-sensitive login errors:
	  @user.email.downcase!
	   if @user.save
---
INSERT INTO "users" ("fullName", "password_digest", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"